usr.sbin/automountd/automount.8
.\" Copyright (c) 2014 The FreeBSD Foundation
.\" All rights reserved.
.\"
.\" This software was developed by Edward Tomasz Napierala under sponsorship
.\" from the FreeBSD Foundation.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHORS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHORS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd April 20, 2014
.Dt AUTOMOUNT 8
.Os
.Sh NAME
.Nm automount
.Nd update autofs mounts
.Sh SYNOPSIS
.Nm
.Op Fl D name=value
.Op Fl L
.Op Fl f
.Op Fl v
.Op Fl u
.Sh DESCRIPTION
When called without options, the
.Nm
command parses the
.Xr auto_master 5
configuration file and any direct maps it references, and mounts or unmounts
.Xr autofs 4
filesystems to match.
The following options are available:
.Bl -tag -width ".Fl v"
.It Fl D
Define a variable.
Note that in case of automount, it is only useful with -L.
.It Fl L
Do not mount or unmount anything; instead parse
.Xr auto_master 5
and direct maps and print them to standard output.
When specified more than once, all the maps, including indirect ones,
will be parsed and shown.
This is useful when debugging configuration problems.
.It Fl f
Force unmount, to be used with -u.
.It Fl u
Try to unmount filesystems mounted by
.Xr automountd 8
daemon.
Note that this does not include autofs mounts done by
.Nm .
To unmount all autofs mounts, use "umount -At autofs".
.It Fl v
Increase verbosity.
.El
.Sh EXIT STATUS
.Ex -std
.Sh EXAMPLES
Unmount all filesystems mounted by
Xr automountd 8 :
.Dl Nm Fl u
.Sh SEE ALSO
.Xr auto_master 5 ,
.Xr automountd 8 ,
.Xr autounmountd 8
.Sh HISTORY
The
.Nm
command appeared in
.Fx 10.2 .
.Sh AUTHORS
The
.Nm
was developed by
.An Edward Tomasz Napierala Aq trasz@FreeBSD.org
under sponsorship from the FreeBSD Foundation.
